docs: update diagrams
